USE SBERMARKET;

INSERT INTO users (firstname, lastname, email, phone, birthday, city, street) VALUES
	('Елизавета', 'Звездная', 'Liza1241@mail.ru', '89156125462', '1990-10-05', 'Брянск', 'Советская'),
	('Алексей', 'Фомин', 'Foma32@list.ru', '89459293763', '1993-08-23', 'Брянск', 'Бурова'),
	('Андрей', 'Ветровой', 'Veter.Andr@list.ru', '89472169831', '1989-05-08', 'Брянск', 'Костачева'),
	('Дмитрий', 'Дмитриев', 'Dimas@mail.ru', '89412364875', '1991-01-01', 'Брянск', 'Красных-партизан'),
	('Юрий', 'Хамов', 'Urka.Xam888@mail.ru', '89456129345', '1977-11-27', 'Брянск', 'Хмельницкого'),
	('Иван', 'Барабан', 'Baraban81@list.ru', '89453612389', '1988-06-17', 'Брянск', 'Севская'),
	('Ира', 'Художная', 'Ira@iandex.ru', '89412367891', '1993-07-11', 'Брянск', 'Крахмалева'),
	('Анастасия', 'Счастливая', 'Nastuha@mail.ru', '98123451567', '1997-10-21', 'Брянск', 'Бежицкая'),
	('Евгений', 'Читеров', 'Jeka.zlodei321@mail.ru', '98112233445', '1991-03-08', 'Брянск', 'Интернационала'),
	('Александр', 'Бизонов', 'Sahok.Bizon228@list.ru', '89312457689', '1991-06-30', 'Брянск', 'Фокина');

INSERT INTO products (name, description, price, catalog_id, updated_at) VALUES
	('Бананы', 'Свежие фрукты, тропические', 73.69, 1, now()),
	('Персики', 'Косточковые Абхазия', 115.79, 1, now()),
	('Яблоки', 'Штрифель Россия', 63.20, 1, now()),
	('Помидоры', 'Сливоводные Россия', 105.29, 1, now()),
	('ЭкоНива', 'Кефир 1% 1л', 81.70, 2, now()),
	('БМК', 'Молоко 3,2% 1л', 79.70, 2, now()),
	('fruttis', 'Йогурт 250мл', 19.22, 2, now()),
	('Сметанино', 'Яйца 10шт', 89.15, 2, now()),
	('Мираторг', 'Свиной Окорок', 378.44, 3, now()),
	('Мираторг', 'Свиная Шея', 419.59, 3, now()),
	('Петелино', 'Филе Бедра', 156.55, 3, now()),
	('Петелино', 'Филе Грудки', 215.80, 3, now()),
	('Добрый', 'Сок яблочный 2л', 120.10, 4, now()),
	('Фруктовый Сад', 'Сок апельсиновый 1л', 80.90, 4, now()),
	('BonAqua', 'Вода минеральная столовая 2л', 51.37, 4, now()),
	('Ушастый Нянь', 'Порошок 3кг', 483.11, 5, now()),
	('Vernel', 'Кондиционер 900мл', 273.99, 5, now()),
	('Lenor', 'Кондиционер 900мл', 270.15, 5, now()),
	('Vanish', 'Отбеливатель 900мл', 188.46, 5, now()),
	('DURACELL', 'Батарейки АА 4шт', 132.01, 6, now()),
	('Samsung', 'Пылесос с емкостью пылесборника 1,3л', 6300.00, 6, now()),
	('Haier', 'Холодильник с функцией No Frost', 28000.00, 6, now());

INSERT INTO basket (user_id, order_id, product_id, updated_at) VALUES
	(1, 1, 2, now()),
	(2, 2, 13, now()),
	(3, 3, 16, now()),
	(4, 4, 8, now()),
	(5, 5, 9, now()),
	(1, 6, 22, now()),
	(6, 7, 14, now()),
	(7, 8, 11, now()),
	(8, 9, 19, now()),
	(9, 10, 5, now()),
	(10, 11, 21, now());

INSERT INTO catalogs (id, name) VALUES
	(NULL, 'Овощи, фрукты, орехи'),
	(NULL, 'Молочные продукты, яйца'),
	(NULL, 'Мясо, птица'),
	(NULL, 'Напитки'),
	(NULL, 'Бытовая химия, уборка'),
	(NULL, 'Бытовая техника');

INSERT INTO employees (employee_name, phone_employee, status) VALUES
	('Элла', '89614892014', 'picker'),
	('Ира', '89124683913', 'picker'),
	('Лиза', '89128472341', 'picker'),
	('Наташа', '89123367813', 'picker'),
	('Настя', '89765437911', 'picker'),
	('Игорь', '89154731986', 'deliveryman'),
	('Алексей', '89175643829', 'deliveryman'),
	('Вадим', '89643818473', 'deliveryman'),
	('Денис', '89463817463', 'deliveryman'),
	('Сергей', '89564834591', 'deliveryman');
	
INSERT INTO `order` (user_id, employees_id, updated_at) VALUES
	(1, 1, now()),
	(2, 2, now()),
	(3, 2, now()),
	(4, 1, now()),
	(5, 2, now()),
	(1, 2, now()),
	(6, 1, now()),
	(7, 1, now()),
	(8, 1, now()),
	(9, 1, now()),
	(10, 2, now());

INSERT INTO discounts (product_id, discount, started_at , finished_at) VALUES
	(2, 0.3,  '2021-09-13 09:00:05', '2021-09-20 09:00:05'),
	(18, 0.8, '2021-10-18 09:00:05', '2021-10-25 09:00:05'),
	(21, 1.0, '2021-11-22 09:00:05', '2021-11-29 09:00:05'),
	(4, 0.2, '2021-09-11 09:00:05', '2021-09-18 09:00:05'),
	(17, 0.4, '2021-12-09 09:00:05', '2021-12-16 09:00:05'),
	(9, 0.6, '2021-11-30 09:00:05', '2021-12-07 09:00:05'),
	(20, 0.1, '2021-10-25 09:00:05', '2021-11-01 09:00:05'),
	(13, 1.0, '2021-09-11 09:00:05', '2021-09-18 09:00:05'),
	(1, 0.2, '2021-11-03 09:00:05', '2021-11-10 09:00:05'),
	(17, 0.5, '2021-12-01 09:00:05', '2021-12-08 09:00:05');

INSERT INTO orders_products (order_id, product_id) VALUES
	('1', '2'),
	('1', '22'),
	('1', '8'),
	('2', '4'),
	('2', '16'),
	('3', '11'),
	('4', '15'),
	('4', '5'),
	('3', '17'),
	('3', '2'),
	('5', '3'),
	('5', '6'),
	('5', '19'),
	('6', '6'),
	('6', '20'),
	('6', '21'),
	('7', '13'),
	('7', '12'),
	('8', '15'),
	('8', '11'),
	('8', '7'),
	('9', '8'),
	('9', '9'),
	('9', '11'),
	('8', '3'),
	('10', '4'),
	('10', '15'),
	('10', '17'),
	('10', '21');



























